<a href="https://colab.research.google.com/github/VeraaaaWei/data_analytics/blob/Python/loc%26iloc%20function.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
data=pd.DataFrame(np.arange(16).reshape(4,4),index=list('abcd'),columns=list('ABCD'))
data

    A   B   C   D
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [3]:
#extract row 'a'
data.loc['a']

A    0
B    1
C    2
D    3
Name: a, dtype: int64

In [4]:
#extract the first row
data.iloc[0]

A    0
B    1
C    2
D    3
Name: a, dtype: int64

In [5]:
#extract all rows in column 'A', 'B'...:data.loc[:,['A','B',...]]
data.loc[:,['A']]

    A
a   0
b   4
c   8
d  12

In [6]:
#extract all columns in row 'a', 'b'...:data.loc['a','b'...,:]
data.loc[['a'],:]

   A  B  C  D
a  0  1  2  3

In [10]:
#extract all rows in column 0, 1...:data.iloc[:,[0,1,...]]
data.iloc[:,[1]]

    B
a   1
b   5
c   9
d  13

In [11]:
#extract all columns in row 0, 1...:data.loc[0,1...,:]
data.iloc[[1],:]

   A  B  C  D
b  4  5  6  7

In [13]:
#extract areas with loc
data.loc[['a','b','c'],['A','B','C']]

   A  B   C
a  0  1   2
b  4  5   6
c  8  9  10

In [14]:
#extract areas with iloc
data.iloc[[0,1],[0,1,2,3]]

   A  B  C  D
a  0  1  2  3
b  4  5  6  7

In [15]:
#extract all data with loc
data.loc[:,:]

    A   B   C   D
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [17]:
#extract all data with iloc
data.iloc[:,:]

    A   B   C   D
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [24]:
#extract data with some filter conditions like give out the row data where there is an'6' in column 'C'
data.loc[data['C']==6]

   A  B  C  D
b  4  5  6  7